## Final Project Submission

Please fill out:
* Student name: 
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [60]:
# Your code here - remember to use markdown cells for comments as well!

import os,glob
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [61]:
folder = "/Users/ethankunin/Documents/Flatiron/Phase_1/Movie_Project1/dsc-phase-1-project/zippedData/"
os.listdir(folder)
#/Users/ethankunin/Documents/Flatiron/Phase_1/Movie_Project1/dsc-phase-1-project
#folder = "../../../Projects/dsc-phase-1-project/zippedData/"

['imdb.title.crew.csv.gz',
 'tmdb.movies.csv.gz',
 'imdb.title.akas.csv.gz',
 'imdb.title.ratings.csv.gz',
 'imdb.name.basics.csv.gz',
 'rt.reviews.tsv.gz',
 'imdb.title.basics.csv.gz',
 'rt.movie_info.tsv.gz',
 'tn.movie_budgets.csv.gz',
 'bom.movie_gross.csv.gz',
 'imdb.title.principals.csv.gz']

In [62]:
f"{folder}*.csv*"

'/Users/ethankunin/Documents/Flatiron/Phase_1/Movie_Project1/dsc-phase-1-project/zippedData/*.csv*'

In [63]:
files = glob.glob(f"{folder}*.csv*")
files[6]

'/Users/ethankunin/Documents/Flatiron/Phase_1/Movie_Project1/dsc-phase-1-project/zippedData/tn.movie_budgets.csv.gz'

In [64]:
files[0].replace('.csv.gz','').split('/')[-1].replace('.','_')

'imdb_title_crew'

In [65]:
tables = {}
dashes='---'*25

for file in files:
    ## Save a variable-friendly version of the file name
    table_name = file.replace('.csv.gz','').split('/')[-1].replace('.','_')
    print(dashes)
    
    ## Load and preview dataframe
    print(f"Preview of {table_name}")
    tables[table_name] = pd.read_csv(file)
    display(tables[table_name].head(5))
    print()

---------------------------------------------------------------------------
Preview of imdb_title_crew

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

---------------------------------------------------------------------------
Preview of tmdb_movies

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

---------------------------------------------------------------------------
Preview of imdb_title_akas

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

---------------------------------------------------------------------------
Preview of imdb_title_ratings

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

---------------------------------------------------------------------------
Preview of imdb_name_basics

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

---------------------------------------------------------------------------
Preview of imdb_title_basics

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

---------------------------------------------------------------------------
Preview of tn_movie_budgets

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

---------------------------------------------------------------------------
Preview of bom_movie_gross

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

---------------------------------------------------------------------------
Preview of imdb_title_principals

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

### quick description of each file: where I see value

imdb_title_crew - value if I can see how directors/writers are linked to movies

tmdb_movies - nothing really here, maybe genre_ids

imdb_title_akas - needed to join to IMDB base because title_id

imdb_title_ratings - not necessary

imdb_name_basics - can weed out directors/known for can use for movies and then join

imdb_title_basics - useful for runtime and genres

tn_movie_budgets - good for release date (seasons) and profit margin

bom_movie_gross - ^ is superior

imdb_title_principals - can use to figure out director/actor/producer. might be better than imdb_name_basics

In [66]:
filepath0 = files[0]
imdb_title_crew = pd.read_csv(filepath0)
imdb_title_crew.head()

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [67]:
filepath1 = files[1]
tmdb_movies = pd.read_csv(filepath1)
tmdb_movies.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [68]:
filepath2 = files[2]
imdb_title_akas = pd.read_csv(filepath2)
imdb_title_akas.head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

In [69]:
filepath3 = files[3]
imdb_title_ratings = pd.read_csv(filepath3)
imdb_title_ratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [70]:
filepath4 = files[4]
imdb_name_basics = pd.read_csv(filepath4)
imdb_name_basics.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [71]:
filepath5 = files[5]
imdb_title_basics = pd.read_csv(filepath5)
imdb_title_basics.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [72]:
filepath6 = files[6]
tn_movie_budgets = pd.read_csv(filepath6)
tn_movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [73]:
filepath7 = files[7]
bom_movie_gross = pd.read_csv(filepath7)
bom_movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [74]:
filepath8 = files[8]
imdb_title_principals = pd.read_csv(filepath8)
imdb_title_principals.head()

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

- Observe that tconst denotes an ID of the title, which links to imdb_title_principals
- Can perform inner join here to determine the actor/director of specified films
- Observe that tconst denotes ID of person, which links imdb_title_principals to imdb_name_basics

In [75]:
# Link category (role) to primary_name (name)

role_name = imdb_title_principals.merge(imdb_name_basics, how='inner', on = 'nconst')

In [76]:
role_name.head()

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]",Tommy Dysart,NaN,NaN,actor,"tt0093120,tt0076974,tt0084296,tt0077064"
1,tt0111414,2,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414"
2,tt5573596,5,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414"
3,tt0111414,3,nm3739909,producer,producer,NaN,Barry Porter-Robinson,NaN,NaN,"producer,art_department","tt0290884,tt0101374,tt0111414,tt1566940"
4,tt0323808,10,nm0059247,editor,NaN,NaN,Sean Barton,1944.0,NaN,"editor,editorial_department,assistant_director","tt0402910,tt1022883,tt0086190,tt0490181"

In [77]:
# Link role_name to movie titles using t_const thru imdb_title_basics showing primary_titles

name_role_movie = role_name.merge(imdb_title_basics, on='tconst', how='left')

In [78]:
name_role_movie.head()

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,known_for_titles,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]",Tommy Dysart,NaN,NaN,actor,"tt0093120,tt0076974,tt0084296,tt0077064",A Thin Life,A Thin Life,2018,75.0,Comedy
1,tt0111414,2,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414",A Thin Life,A Thin Life,2018,75.0,Comedy
2,tt5573596,5,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy
3,tt0111414,3,nm3739909,producer,producer,NaN,Barry Porter-Robinson,NaN,NaN,"producer,art_department","tt0290884,tt0101374,tt0111414,tt1566940",A Thin Life,A Thin Life,2018,75.0,Comedy
4,tt0323808,10,nm0059247,editor,NaN,NaN,Sean Barton,1944.0,NaN,"editor,editorial_department,assistant_director","tt0402910,tt1022883,tt0086190,tt0490181",The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror"

In [79]:
# extraneous values s.t. Panic Room will return Panic Room from 2018 not Panic Room made by David Fincher.
# Key aspect is the director. think about how actor names can be added
name_role_movie.loc[name_role_movie['primary_name']=='James Cameron'].sort_values(by='primary_title')

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,known_for_titles,primary_title,original_title,start_year,runtime_minutes,genres
143638,tt0437086,6,nm0000116,writer,screenplay by,NaN,James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Alita: Battle Angel,Alita: Battle Angel,2019,122.0,"Action,Adventure,Sci-Fi"
143653,tt7105720,2,nm0000116,archive_footage,NaN,"[""Filmmaker"",""Activist""]",James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Answers to Questions You Didn't Know to Ask Ab...,Answers to Questions You Didn't Know to Ask Ab...,2018,NaN,Documentary
143645,tt1630029,5,nm0000116,director,NaN,NaN,James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Avatar 2,Avatar 2,2021,NaN,"Action,Adventure,Fantasy"
143644,tt1757678,5,nm0000116,director,NaN,NaN,James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Avatar 3,Avatar 3,2023,NaN,"Action,Adventure,Drama"
143646,tt3095356,5,nm0000116,director,NaN,NaN,James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Avatar 4,Avatar 4,2025,NaN,"Action,Adventure,Fantasy"
143652,tt5637536,5,nm0000116,director,NaN,NaN,James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Avatar 5,Avatar 5,2027,NaN,"Action,Adventure,Fantasy"
143643,tt2013207,2,nm0000116,self,NaN,"[""Himself""]",James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Brian May's Brief History of 3D,Brian May's Brief History of 3D,2011,NaN,Documentary
143642,tt2332883,1,nm0000116,self,NaN,"[""Himself""]",James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Deepsea Challenge 3D,Deepsea Challenge 3D,2014,91.0,Documentary
143649,tt6232592,4,nm0000116,self,NaN,"[""Himself""]",James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Diving Deep: The Life and Times of Mike deGruy,Diving Deep: The Life and Times of Mike deGruy,2019,NaN,Documentary
143651,tt5241760,3,nm0000116,self,NaN,"[""Himself""]",James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Eating You Alive,Eating You Alive,2018,108.0,Documentary
143637,tt1927124,1,nm0000116,self,NaN,"[""Himself""]",James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Hollywood between Paranoia and Sci-Fi. The Pow...,Science-fiction et paranoïa. La culture de la ...,2011,55.0,Documentary
143635,tt2004304,2,nm0000116,self,NaN,"[""Himself""]",James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Mission Blue,Mission Blue,2014,95.0,"Documentary,Drama"
143648,tt3020814,1,nm0000116,self,NaN,"[""Himself""]",James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Reflections on Titanic,Reflections on Titanic,2012,65.0,Documentary
143640,tt2306723,2,nm0000116,self,NaN,"[""Himself""]",James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Secret Life of Old Rose: The Art of Gloria Stuart,Secret Life of Old Rose: The Art of Gloria Stuart,2012,NaN,Documentary
143647,tt4062624,1,nm0000116,self,NaN,"[""Himself""]",James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Side by Side Extra: Volume Three,Side by Side Extra: Volume Three,2014,NaN,Documentary
143641,tt1745826,1,nm0000116,self,NaN,"[""Himself""]",James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Solartaxi: Around the World with the Sun,Solartaxi: Around the World with the Sun,2010,76.0,"Adventure,Documentary"
143639,tt1340138,8,nm0000116,writer,based on characters created by,NaN,James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Terminator Genisys,Terminator Genisys,2015,126.0,"Action,Adventure,Sci-Fi"
143650,tt6450804,6,nm0000116,writer,story by,NaN,James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Terminator: Dark Fate,Terminator: Dark Fate,2019,NaN,"Action,Adventure,Sci-Fi"
143636,tt2169432,1,nm0000116,self,NaN,"[""Himself""]",James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Titanic: 100 Years On,Titanic: 100 Years On,2012,70.0,NaN

In [80]:
movie_directors = name_role_movie.loc[name_role_movie['category'] == 'director']

In [81]:
movie_directors.loc[movie_directors['primary_name']=='James Cameron']

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,known_for_titles,primary_title,original_title,start_year,runtime_minutes,genres
143644,tt1757678,5,nm0000116,director,NaN,NaN,James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Avatar 3,Avatar 3,2023,NaN,"Action,Adventure,Drama"
143645,tt1630029,5,nm0000116,director,NaN,NaN,James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Avatar 2,Avatar 2,2021,NaN,"Action,Adventure,Fantasy"
143646,tt3095356,5,nm0000116,director,NaN,NaN,James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Avatar 4,Avatar 4,2025,NaN,"Action,Adventure,Fantasy"
143652,tt5637536,5,nm0000116,director,NaN,NaN,James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Avatar 5,Avatar 5,2027,NaN,"Action,Adventure,Fantasy"

In [82]:
# merge tn movie budgets to view who the director of each film is. seems to work outside of Avatar

In [83]:
budgets_directors = tn_movie_budgets.merge(movie_directors, left_on = 'movie', right_on = 'primary_title', how='inner')

In [84]:
budgets_directors.head(25)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,tconst,ordering,nconst,category,...,primary_name,birth_year,death_year,primary_profession,known_for_titles,primary_title,original_title,start_year,runtime_minutes,genres
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279",tt1775309,5,nm3786927,director,...,Atsushi Wada,NaN,NaN,director,"tt1594549,tt1775309,tt1602612",Avatar,Abatâ,2011,93.0,Horror
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",tt1298650,5,nm0551128,director,...,Rob Marshall,1960.0,NaN,"director,miscellaneous,producer","tt2180411,tt0299658,tt0875034,tt5028340",Pirates of the Caribbean: On Stranger Tides,Pirates of the Caribbean: On Stranger Tides,2011,136.0,"Action,Adventure,Fantasy"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",tt6565702,5,nm1334526,director,...,Simon Kinberg,1973.0,NaN,"producer,writer,director","tt1502712,tt3315342,tt1877832,tt3659388",Dark Phoenix,Dark Phoenix,2019,113.0,"Action,Adventure,Sci-Fi"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",tt2395427,5,nm0923736,director,...,Joss Whedon,1964.0,NaN,"writer,producer,director","tt0118276,tt0162065,tt0848228,tt1259521",Avengers: Age of Ultron,Avengers: Age of Ultron,2015,141.0,"Action,Adventure,Sci-Fi"
4,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200",tt4154756,5,nm0751577,director,...,Anthony Russo,1970.0,NaN,"producer,director,writer","tt1843866,tt4154756,tt3498820,tt4154796",Avengers: Infinity War,Avengers: Infinity War,2018,149.0,"Action,Adventure,Sci-Fi"
5,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200",tt4154756,6,nm0751648,director,...,Joe Russo,1971.0,NaN,"producer,director,writer","tt4154756,tt4154796,tt1843866,tt3498820",Avengers: Infinity War,Avengers: Infinity War,2018,149.0,"Action,Adventure,Sci-Fi"
6,9,"Nov 17, 2017",Justice League,"$300,000,000","$229,024,295","$655,945,209",tt0974015,5,nm0811583,director,...,Zack Snyder,1966.0,NaN,"producer,director,writer","tt0770828,tt0451279,tt0409459,tt0416449",Justice League,Justice League,2017,120.0,"Action,Adventure,Fantasy"
7,10,"Nov 6, 2015",Spectre,"$300,000,000","$200,074,175","$879,620,923",tt2379713,5,nm0005222,director,...,Sam Mendes,1965.0,NaN,"producer,director,miscellaneous","tt0959337,tt1074638,tt0257044,tt0169547",Spectre,Spectre,2015,148.0,"Action,Adventure,Thriller"
8,11,"Jul 20, 2012",The Dark Knight Rises,"$275,000,000","$448,139,099","$1,084,439,099",tt1345836,5,nm0634240,director,...,Christopher Nolan,1970.0,NaN,"writer,producer,director","tt0482571,tt1375666,tt5013056,tt0154506",The Dark Knight Rises,The Dark Knight Rises,2012,164.0,"Action,Thriller"
9,12,"May 25, 2018",Solo: A Star Wars Story,"$275,000,000","$213,767,512","$393,151,347",tt3778644,5,nm0000165,director,...,Ron Howard,1954.0,NaN,"actor,producer,director","tt0112384,tt0268978,tt0367279,tt0870111",Solo: A Star Wars Story,Solo: A Star Wars Story,2018,135.0,"Action,Adventure,Fantasy"
10,13,"Jul 2, 2013",The Lone Ranger,"$275,000,000","$89,302,115","$260,002,115",tt1210819,5,nm0893659,director,...,Gore Verbinski,1964.0,NaN,"director,producer,writer","tt4731136,tt0325980,tt1192628,tt1210819",The Lone Ranger,The Lone Ranger,2013,150.0,"Action,Adventure,Western"
11,14,"Mar 9, 2012",John Carter,"$275,000,000","$73,058,679","$282,778,100",tt0401729,5,nm0004056,director,...,Andrew Stanton,1965.0,NaN,"writer,actor,producer","tt0120623,tt0266543,tt2277860,tt0910970",John Carter,John Carter,2012,132.0,"Action,Adventure,Sci-Fi"
12,15,"Nov 24, 2010",Tangled,"$260,000,000","$200,821,936","$586,477,240",tt0398286,5,nm1977355,director,...,Nathan Greno,1975.0,NaN,"actor,art_department,director","tt2112281,tt0396555,tt0398286,tt2245084",Tangled,Tangled,2010,100.0,"Adventure,Animation,Comedy"
13,15,"Nov 24, 2010",Tangled,"$260,000,000","$200,821,936","$586,477,240",tt0398286,6,nm0397174,director,...,Byron Howard,1968.0,NaN,"animation_department,director,actor","tt0398286,tt0328880,tt2948356,tt0397892",Tangled,Tangled,2010,100.0,"Adventure,Animation,Comedy"
14,17,"May 6, 2016",Captain America: Civil War,"$250,000,000","$408,084,349","$1,140,069,413",tt3498820,5,nm0751577,director,...,Anthony Russo,1970.0,NaN,"producer,director,writer","tt1843866,tt4154756,tt3498820,tt4154796",Captain America: Civil War,Captain America: Civil War,2016,147.0,"Action,Adventure,Sci-Fi"
15,17,"May 6, 2016",Captain America: Civil War,"$250,000,000","$408,084,349","$1,140,069,413",tt3498820,6,nm0751648,director,...,Joe Russo,1971.0,NaN,"producer,director,writer","tt4154756,tt4154796,tt1843866,tt3498820",Captain America: Civil War,Captain America: Civil War,2016,147.0,"Action,Adventure,Sci-Fi"
16,18,"Mar 25, 2016",Batman v Superman: Dawn of Justice,"$250,000,000","$330,360,194","$867,500,281",tt2975590,5,nm0811583,director,...,Zack Snyder,1966.0,NaN,"producer,director,writer","tt0770828,tt0451279,tt0409459,tt0416449",Batman v Superman: Dawn of Justice,Batman v Superman: Dawn of Justice,2016,151.0,"Action,Adventure,Fantasy"
17,19,"Dec 14, 2012",The Hobbit: An Unexpected Journey,"$250,000,000","$303,003,568","$1,017,003,568",tt0903624,5,nm0001392,director,...,Peter Jackson,1961.0,NaN,"producer,director,writer","tt0167260,tt0092610,tt0120737,tt0360717",The Hobbit: An Unexpected Journey,The Hobbit: An Unexpected Journey,2012,169.0,"Adventure,Family,Fantasy"
18,21,"Dec 13, 2013",The Hobbit: The Desolation of Smaug,"$250,000,000","$258,366,855","$960,366,855",tt1170358,5,nm0001392,director,...,Peter Jackson,1961.0,NaN,"producer,director,writer","tt0167260,tt0092610,tt0120737,tt0360717",The Hobbit: The Desolation of Smaug,The Hobbit: The Desolation of Smaug,2013,161.0,"Adventure,Fantasy"
19,22,"Dec 17, 2014",The Hobbit: The Battle of the Five Armies,"$250,000,000","$255,119,788","$945,577,621",tt2310332,5,nm0001392,director,...,Peter Jackson,1961.0,NaN,"producer,director,writer","tt0167260,tt0092610,tt0120737,tt0360717",The Hobbit: The Battle of the Five Armies,The Hobbit: The Battle of the Five Armies,2014,144.0,"Adventure,Fantasy"
20,23,"Apr 14, 2017",The Fate of the Furious,"$250,000,000","$225,764,765","$1,234,846,267",tt4630562,5,nm0336620,director,...,F. Gary Gray,1969.0,NaN,"director,actor,producer","tt0120768,tt0117603,tt0113118,tt0317740",The Fate of the Furious,The Fate of the Furious,2017,136.0,"Action,Crime,Thriller"
21,25,"May 26, 2017",Pirates of the Caribbean: Dead Men Tell No Tales,"$230,000,000","$172,558,876","$788,241,137",tt1790809,5,nm1461392,director,...,Joachim Rønning,1972.0,NaN,"director,writer,producer","tt1613750,tt1029235,tt1790809",Pirates of the Caribbean: Dead Men Tell No Tales,Pirates of the Caribbean: Dead Men Tell No Tales,2017,129.0,"Action,Adventure,Fantasy"
22,25,"May 26, 2017",Pirates of the Caribbean: Dead Men Tell No Tales,"$230,000,000","$172,558,876","$788,241,137",tt1790809,6,nm1650283,director,...,Espen Sandberg,1971.0,NaN,"director,producer,executive","tt1790809,tt0416496,tt1613750,tt1029235",Pirates of the Caribbean: Dead Men Tell No Tales,Pirates of the Caribbean: Dead Men Tell No Tales,2017,129.0,"Action,Adventure,Fantasy"
23,27,"May 4, 2012",The Avengers,"$225,000,000","$623,279,547","$1,517,935,897",tt0848228,5,nm0923736,director,...,Joss Whedon,1964.0,NaN,"writer,producer,director","tt0118276,tt0162065,tt0848228,tt1259521",The Avengers,The Avengers,2012,143.0,"Action,Adventure,Sci-Fi"
24,35,"Aug 14, 1998",The Avengers,"$60,000,000","$23,385,416","$48,585,416",tt0848228,5,nm0923736,director,...,Joss Whedon,1964.0,NaN,"writer,producer,director","tt0118276,tt0162065,tt0848228,tt1259521",The Avengers,The Avengers,2012,143.0,"Action,Adventure,Sci-Fi"

In [85]:
# # Turn Production budget, domestic gross, worldwide gross into numeric values
# budgets_directors['production_budget'].map(lambda x: x.replace('$', '')).map(lambda x: x.replace(',', '')).astype('int')

In [86]:

# budgets_directors['domestic_gross'] = budgets_directors['domestic_gross'].map(lambda x: x.replace('$', '')).map(lambda x: x.replace(',', '')).astype('int')

In [87]:
# budgets_directors['worldwide_gross'] = budgets_directors['worldwide_gross'].map(lambda x: x.replace('$', '')).map(lambda x: x.replace(',', '')).astype('int')

In [88]:
budgets_directors.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,tconst,ordering,nconst,category,...,primary_name,birth_year,death_year,primary_profession,known_for_titles,primary_title,original_title,start_year,runtime_minutes,genres
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279",tt1775309,5,nm3786927,director,...,Atsushi Wada,NaN,NaN,director,"tt1594549,tt1775309,tt1602612",Avatar,Abatâ,2011,93.0,Horror
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",tt1298650,5,nm0551128,director,...,Rob Marshall,1960.0,NaN,"director,miscellaneous,producer","tt2180411,tt0299658,tt0875034,tt5028340",Pirates of the Caribbean: On Stranger Tides,Pirates of the Caribbean: On Stranger Tides,2011,136.0,"Action,Adventure,Fantasy"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",tt6565702,5,nm1334526,director,...,Simon Kinberg,1973.0,NaN,"producer,writer,director","tt1502712,tt3315342,tt1877832,tt3659388",Dark Phoenix,Dark Phoenix,2019,113.0,"Action,Adventure,Sci-Fi"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",tt2395427,5,nm0923736,director,...,Joss Whedon,1964.0,NaN,"writer,producer,director","tt0118276,tt0162065,tt0848228,tt1259521",Avengers: Age of Ultron,Avengers: Age of Ultron,2015,141.0,"Action,Adventure,Sci-Fi"
4,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200",tt4154756,5,nm0751577,director,...,Anthony Russo,1970.0,NaN,"producer,director,writer","tt1843866,tt4154756,tt3498820,tt4154796",Avengers: Infinity War,Avengers: Infinity War,2018,149.0,"Action,Adventure,Sci-Fi"

In [89]:
# # Change columns to reflect $
# budgets_directors.rename(columns={'production_budget': 'Production_Budget_$', 'domestic_gross': 'Domestic_Gross_$', 'worldwide_gross': 'WorldWide_Gross_$'}, inplace=True)

In [90]:
# Start pulling out outliers from data set

https://www.marketwatch.com/story/netflix-reportedly-set-to-produce-90-movies-a-year-with-budgets-up-to-200-million-2018-12-16

Sweetspot between $20 million - $200 million
Will remove movies below $20 million from data set. Use this bound for analysis

In [91]:
# budgets_directors = budgets_directors.loc[budgets_directors['Production_Budget_$'] > 20000000]

Our data-set now contains 1,634 films, all contains budgets in excess of $20 million

In [92]:
# budgets_directors['Production_Budget_$'].head(20).sort_values().plot(kind='barh')

In [93]:
# # Create column to represent profit-margin, which will be our indicator for success

# budgets_directors['Profit_Margin'] = budgets_directors['WorldWide_Gross_$'] / budgets_directors['Production_Budget_$']

In [94]:
# bd_dropped = budgets_directors.drop_duplicates(subset= 'id', keep='first')

In [95]:
# bd_dropped.release_date.unique()

In [96]:
len(tn_movie_budgets)

5782

In [97]:
tn_movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [98]:
#Parsing through the duplicates on the movie columns are remakes. No duplicates when using movie & release date subset
tn_movie_budgets[tn_movie_budgets.duplicated(subset=['movie', 'release_date'])]

Empty DataFrame
Columns: [id, release_date, movie, production_budget, domestic_gross, worldwide_gross]
Index: []

In [99]:
tn_movie_budgets['production_budget'] = tn_movie_budgets['production_budget'].map(lambda x: x.replace('$', '')).map(lambda x: x.replace(',', '')).astype('int')

In [100]:
tn_movie_budgets['domestic_gross'] = tn_movie_budgets['domestic_gross'].map(lambda x: x.replace('$', '')).map(lambda x: x.replace(',', '')).astype('int')

In [101]:
tn_movie_budgets['worldwide_gross'] = tn_movie_budgets['worldwide_gross'].map(lambda x: x.replace('$', '')).map(lambda x: x.replace(',', '')).astype('int')

In [102]:
len(tn_movie_budgets)

5782

In [103]:
big_budget = tn_movie_budgets.loc[tn_movie_budgets['production_budget'] > 20000000]

In [112]:
big_budget.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747

In [132]:
big_budget_2 = big_budget.copy()

In [133]:
big_budget_2

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747
...,...,...,...,...,...,...
2480,81,"Oct 22, 1999",Molly,21000000,17396,17396
2481,82,"Feb 1, 2019",Velvet Buzzsaw,21000000,0,0
2482,83,"Apr 23, 1999",eXistenZ,20700000,2840417,2840417
2483,84,"Jul 23, 1982",The Best Little Whorehouse in Texas,20500000,69701637,69701637
2484,85,"Aug 11, 2006",Pulse,20500000,20264436,30241435

In [134]:
big_budget_2['month'] = big_budget_2['release_date'].map(lambda x: x[0:3])

In [135]:
big_budget_2

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,month
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,Dec
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,May
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,Jun
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,May
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,Dec
...,...,...,...,...,...,...,...
2480,81,"Oct 22, 1999",Molly,21000000,17396,17396,Oct
2481,82,"Feb 1, 2019",Velvet Buzzsaw,21000000,0,0,Feb
2482,83,"Apr 23, 1999",eXistenZ,20700000,2840417,2840417,Apr
2483,84,"Jul 23, 1982",The Best Little Whorehouse in Texas,20500000,69701637,69701637,Jul
2484,85,"Aug 11, 2006",Pulse,20500000,20264436,30241435,Aug

In [136]:
month_map = {'Dec':12}

In [138]:
big_budget_2['month_num'] = big_budget_2['month'].map(month_map)

In [139]:
big_budget_2

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,month,month_num
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,Dec,12.0
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,May,NaN
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,Jun,NaN
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,May,NaN
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,Dec,12.0
...,...,...,...,...,...,...,...,...
2480,81,"Oct 22, 1999",Molly,21000000,17396,17396,Oct,NaN
2481,82,"Feb 1, 2019",Velvet Buzzsaw,21000000,0,0,Feb,NaN
2482,83,"Apr 23, 1999",eXistenZ,20700000,2840417,2840417,Apr,NaN
2483,84,"Jul 23, 1982",The Best Little Whorehouse in Texas,20500000,69701637,69701637,Jul,NaN
2484,85,"Aug 11, 2006",Pulse,20500000,20264436,30241435,Aug,NaN